In [3]:
import pandas as pd
import seaborn as sns
import requests
import numpy as np

In [4]:
df = pd.read_json("gme.json")
df2 = pd.read_json("recentGME.json")

In [5]:
df.drop(columns = 'Adj Close')

           Date       Open       High        Low      Close     Volume
0    2002-02-13   2.406250   2.515000   2.381250   2.512500   76216000
1    2002-02-14   2.543750   2.548750   2.481250   2.500000   11021600
2    2002-02-15   2.500000   2.506250   2.462500   2.487500    8389600
3    2002-02-19   2.475000   2.475000   2.343750   2.387500    7410400
4    2002-02-20   2.400000   2.468750   2.381250   2.468750    6892800
...         ...        ...        ...        ...        ...        ...
5595 2024-05-07  15.850000  17.290001  14.930000  16.309999   24308600
5596 2024-05-08  16.049999  17.240000  15.330000  15.920000   24775100
5597 2024-05-09  15.900000  18.510000  15.350000  18.010000   25759300
5598 2024-05-10  17.930000  20.200001  16.879999  17.459999   36831900
5599 2024-05-13  26.340000  38.200001  24.770000  30.450001  182308700

[5600 rows x 6 columns]

In [6]:
pd.concat([df, df2])

         Date      Open      High       Low     Close  Adj Close    Volume
0  2002-02-13   2.40625   2.51500   2.38125   2.51250   1.691666  76216000
1  2002-02-14   2.54375   2.54875   2.48125   2.50000   1.683250  11021600
2  2002-02-15   2.50000   2.50625   2.46250   2.48750   1.674834   8389600
3  2002-02-19   2.47500   2.47500   2.34375   2.38750   1.607504   7410400
4  2002-02-20   2.40000   2.46875   2.38125   2.46875   1.662210   6892800
..        ...       ...       ...       ...       ...        ...       ...
89 2024-09-20  19.63000  22.03000  19.48200  21.85000        NaN  60804837
90 2024-09-23  21.54000  22.56000  21.23010  22.31000        NaN  13945783
91 2024-09-24  22.61000  22.72000  21.54000  22.63000        NaN  12112487
92 2024-09-25  22.16000  22.83000  22.06500  22.18000        NaN   6137420
93 2024-09-26  22.40000  22.64000  21.87000  22.29000        NaN   5771976

[5694 rows x 7 columns]